app/controllers/calculator_controller.rb

  def output
    if Result.find_by(param: "#{@param}") == nil
---
SELECT  "results".* FROM "results" WHERE "results"."param" = ? LIMIT ?  [["param", "3"], ["LIMIT", 1]]